Lecture-2/Lecture-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Harold Carr" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<p>
Source : <a href="https://github.com/input-output-hk/plutus-pioneer-program">https://github.com/input-output-hk/plutus-pioneer-program</a>
</p>

<hr />
<div id="outline-container-orgd7e1400" class="outline-2">
<h2 id="orgd7e1400">Part 1 - Triggering Change</h2>
<div class="outline-text-2" id="text-orgd7e1400">
<p>
<a href="https://www.youtube.com/watch?v=BEr7lcCPjnA">https://www.youtube.com/watch?v=BEr7lcCPjnA</a>
</p>

<p>
For anything to happen on the blockchain, it must be triggered by a TX.
TXs always come from the outside from a user, from a wallet.
</p>

<hr />
</div>
</div>
<div id="outline-container-org9818901" class="outline-2">
<h2 id="org9818901">Part 2 - Low Level, Untyped Validation Scripts</h2>
<div class="outline-text-2" id="text-org9818901">
<p>
<a href="https://www.youtube.com/watch?v=xgnmMl-eIIM">https://www.youtube.com/watch?v=xgnmMl-eIIM</a>
</p>
</div>

<div id="outline-container-org3bde8ab" class="outline-3">
<h3 id="org3bde8ab">review of lecture 1 material</h3>
<div class="outline-text-3" id="text-org3bde8ab">
<p>
on chain
</p>
<ul class="org-ul">
<li>validation</li>
</ul>
<p>
off chain
</p>
<ul class="org-ul">
<li>lives in wallet</li>
<li>constructs/submits TXs</li>
</ul>

<p>
focus on on chain part:
</p>

<p>
simple UTxO model: signatures + TXs
</p>
<ul class="org-ul">
<li>address given by public key (or its hash)</li>
<li>it UTxO sits at such a PK address,
then a TX can consume that UTxO as an input
if the signature belonging to the PK is included in the TX</li>
</ul>

<p>
(e)UTxO model: signatures + TXs + scripts + redeemers + datum + context
</p>
<ul class="org-ul">
<li>adds new type of addresses
<ul class="org-ul">
<li>script addresses that can run arbitrary logic</li>
<li>for a TX to consume a UTxO sitting at a script address
the script is run to decide if the TX is valid</li>
</ul></li>
<li>adds : input : adds "redeemer"
<ul class="org-ul">
<li>arbitrary data</li>
</ul></li>
<li>adds : output : arbitrary data called "datum"
<ul class="org-ul">
<li>state that sits at the UTxO</li>
</ul></li>
<li>adds : context
<ul class="org-ul">
<li>the TX that is being validated,
including all inputs and outputs</li>
</ul></li>
</ul>

<p>
plutus script receives
</p>
<ul class="org-ul">
<li>datum (sitting at the UTxO</li>
<li>redeemer (coming from the input)</li>
<li>context</li>
</ul>
</div>
</div>

<div id="outline-container-org869ee31" class="outline-3">
<h3 id="org869ee31">datum, redeemer, context types</h3>
<div class="outline-text-3" id="text-org869ee31">
<ul class="org-ul">
<li>same data type used for all three at low-level impl of Plutus
<ul class="org-ul">
<li><a href="https://playground.plutus.iohkdev.io/doc/haddock/plutus-tx/html/PlutusTx.html">https://playground.plutus.iohkdev.io/doc/haddock/plutus-tx/html/PlutusTx.html</a></li>
<li><code>BuiltInData</code></li>
<li>no constructor; instead conversion functions from/to <code>Data</code></li>
<li><code>Data</code> similar to JSON format
<ul class="org-ul">
<li>arbitrary data expressed in terms of <code>Data</code></li>
</ul></li>
</ul></li>
<li>can use custom data types for datum and redeemer</li>
<li>but <i>performance implications for custom types</i> (e.g., de/serialization)
<ul class="org-ul">
<li><i>can make a difference in practice</i></li>
</ul></li>
<li>course will use custom types for convenience</li>
</ul>
</div>
</div>

<div id="outline-container-org5080e14" class="outline-3">
<h3 id="org5080e14"><code>Gift.hs</code></h3>
<div class="outline-text-3" id="text-org5080e14">
<p>
See annotated <a href="./Gift.hs"><code>Gift.hs</code></a>
</p>

<ul class="org-ul">
<li>load <code>Gift.hs</code> in playground</li>
<li>Compile</li>
<li>Simulate</li>
<li>Add Wallet</li>
<li>set all 3 wallets to <code>Lovelace 10000000</code></li>

<li>Wallet 1 : give</li>
</ul>
<pre class="example" id="org571ae01">
4000000
</pre>

<ul class="org-ul">
<li>Wallet 2 : give</li>
</ul>
<pre class="example" id="org0a89d3f">
6000000
</pre>

<ul class="org-ul">
<li>Add Wait Action</li>
</ul>
<pre class="example" id="org758b258">
Wait For
Slots            1
</pre>

<ul class="org-ul">
<li>Wallet 3 : grab</li>

<li>Add Wait Action</li>
</ul>
<pre class="example" id="org0ce997b">
Wait For
Slots            1
</pre>

<ul class="org-ul">
<li>Evaluate</li>
</ul>

<p>
<code>Slot 0, Tx 0</code>
</p>
<ul class="org-ul">
<li>genesis TX that distributes funds</li>
</ul>

<p>
<code>Slot 1</code>
</p>
<ul class="org-ul">
<li>two TXs in same slot (since no <code>Wait For</code> was indicated)</li>
<li>for each TX
<ul class="org-ul">
<li>input is Ada (from Wallet)</li>
<li>outputs
<ul class="org-ul">
<li>fee to run TX</li>
<li>balance back to wallet after substracting gift abount and fee</li>
<li>script with given amount</li>
</ul></li>
</ul></li>
</ul>

<p>
<code>Slot 2, Tx 0</code>
</p>
<ul class="org-ul">
<li>inputs are the two script outputs from previous two TXs</li>
<li>outputs are the fee and the amount (minus fee) given to wallet 3
<ul class="org-ul">
<li>note higher fee because a script was executed</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org189ffac" class="outline-3">
<h3 id="org189ffac"><code>Burn.hs</code></h3>
<div class="outline-text-3" id="text-org189ffac">
<p>
Same as <code>Gift</code>, except the validator always fails.
</p>

<p>
Mean that any funds given to this script are locked away forever : BURNT
</p>

<ul class="org-ul">
<li>Return to Editor</li>
<li>load <code>Burn.hs</code> in playground</li>
<li>Compile</li>
<li>Simulate
<ul class="org-ul">
<li>has same info, since endpoints have not changed</li>
</ul></li>
<li>Evaluate</li>
</ul>

<p>
<code>Slot 0, Tx 0</code>
</p>
<ul class="org-ul">
<li>genesis TX that distributes funds</li>
</ul>

<p>
<code>Slot 1</code>
</p>
<ul class="org-ul">
<li>two <code>give</code> TXs in same slot (since no <code>Wait For</code> was indicated)
<ul class="org-ul">
<li>both succeed</li>
</ul></li>
<li>for each TX
<ul class="org-ul">
<li>input is Ada (from Wallet)</li>
<li>outputs
<ul class="org-ul">
<li>fee to run TX</li>
<li>balance back to wallet after substracting gift abount and fee</li>
<li>script with given amount</li>
</ul></li>
</ul></li>

<li>note there is \no\ <code>Slot 2</code> <code>grab</code> TX since the script fails</li>
</ul>
</div>
</div>

<div id="outline-container-org49a6086" class="outline-3">
<h3 id="org49a6086"><code>FortyTwo.hs</code></h3>
<div class="outline-text-3" id="text-org49a6086">
<p>
Same as <code>Gift</code>, except
</p>
<ul class="org-ul">
<li>only passes if <i>redeemer</i> is <code>I 42</code></li>
<li>so <code>grab</code> updated to accept redeemer/Integer</li>

<li>Return to Editor</li>
<li>load <code>FortyTwo.hs</code> in playground</li>
<li>Compile</li>
<li>Simulate
<ul class="org-ul">
<li>note : does NOT have same info, since endpoints have changed</li>
</ul></li>
<li>Evaluate</li>

<li>load <code>Gift.hs</code> in playground</li>
<li>Compile</li>
<li>Simulate</li>
<li>set both wallets
<ul class="org-ul">
<li><code>Lovelace 10000000</code></li>
</ul></li>

<li>Wallet 1 : give</li>
</ul>
<pre class="example" id="orgf41482f">
3000000
</pre>

<ul class="org-ul">
<li>Add Wait Action</li>
</ul>
<pre class="example" id="org51d68eb">
Wait For
Slots            1
</pre>

<ul class="org-ul">
<li>Wallet 3 : grab</li>
</ul>
<pre class="example" id="orgf3806f5">
100
</pre>

<ul class="org-ul">
<li>Add Wait Action</li>
</ul>
<pre class="example" id="org559b8a1">
Wait For
Slots            1
</pre>

<ul class="org-ul">
<li>Evaluate</li>
</ul>

<p>
Note: the <code>grab</code> TX does not succeed.
</p>
<ul class="org-ul">
<li>see <code>wrong redeemer</code> in <code>Trace</code></li>

<li>Return to Editor</li>
<li>Simulate</li>
<li>change <code>Wallet 2: grab</code> to <code>42</code></li>
<li>Evaluate</li>
<li><code>grab</code> TX does succeeds</li>
</ul>

<hr />
</div>
</div>
</div>
<div id="outline-container-org6033f7c" class="outline-2">
<h2 id="org6033f7c">Part 3 - High Level, Typed Validation Scripts</h2>
<div class="outline-text-2" id="text-org6033f7c">
<p>
<a href="https://www.youtube.com/watch?v=HoB_PqeZPNc">https://www.youtube.com/watch?v=HoB_PqeZPNc</a>
</p>
</div>

<div id="outline-container-orgea6a814" class="outline-3">
<h3 id="orgea6a814"><code>Typed.hs</code></h3>
<div class="outline-text-3" id="text-orgea6a814">
<p>
Same as =Gift=m, except uses custom types instead of <code>BuiltInData</code>.
</p>

<p>
See annotated <a href="./Typed.hs"><code>Typed.hs</code></a>
</p>

<p>
Run it in the playground exactly like the <code>FortyTwo.hs</code> example.
</p>

<p>
Type classes to convert from/to <code>BuiltInData</code>
</p>
<ul class="org-ul">
<li><a href="https://playground.plutus.iohkdev.io/doc/haddock/plutus-tx/html/PlutusTx-IsData-Class.html">https://playground.plutus.iohkdev.io/doc/haddock/plutus-tx/html/PlutusTx-IsData-Class.html</a></li>
<li>note : the custom types used in this example have instances defined</li>
</ul>
</div>
</div>

<div id="outline-container-org4491ef0" class="outline-3">
<h3 id="org4491ef0"><code>IsData.hs</code></h3>
<div class="outline-text-3" id="text-org4491ef0">
<p>
Like <code>Typed.hs</code>, except custom redeemer.
</p>

<p>
Instances generated by use of <code>PlutusTx.unstableMakeIsData ''MySillyRedeemer</code>.
</p>

<p>
Works in playground just like the <code>FortyTwo.hs</code> example.
</p>

<hr />
</div>
</div>
</div>
<div id="outline-container-orgd92fd57" class="outline-2">
<h2 id="orgd92fd57">Part 4 - Summary</h2>
<div class="outline-text-2" id="text-orgd92fd57">
<p>
<a href="https://www.youtube.com/watch?v=V5P2gKHos48">https://www.youtube.com/watch?v=V5P2gKHos48</a>
</p>

<ul class="org-ul">
<li><code>Gift.hs</code>
<ul class="org-ul">
<li>validator that always succeeds (ignores all args)</li>
</ul></li>
<li><code>Burn.hs</code>
<ul class="org-ul">
<li>validator that always fails (ignores all args)</li>
</ul></li>
<li><code>FortyTwo.hs</code>
<ul class="org-ul">
<li>validator that only succeeds if redeemer is <code>I 42</code></li>
<li>uses <code>BuiltInData</code></li>
</ul></li>
<li><code>Typed.hs</code>
<ul class="org-ul">
<li>validator that only succeeds if redeemer is <code>42</code></li>
<li>uses existing instances to convert <code>Integer</code> to <code>BuiltInData</code></li>
</ul></li>
<li><code>IsData.hs</code>
<ul class="org-ul">
<li>validator that only succeeds if redeemer is <code>MySillyRedeemer 42</code></li>
<li>uses function to create instances for <code>MySillyRedeemer</code></li>
</ul></li>
</ul>

<hr />
</div>
</div>
<div id="outline-container-orgd54c690" class="outline-2">
<h2 id="orgd54c690">Part 5 - Homework</h2>
<div class="outline-text-2" id="text-orgd54c690">
<p>
<a href="https://www.youtube.com/watch?v=_r-EpXzQGKo">https://www.youtube.com/watch?v=_r-EpXzQGKo</a>
</p>

<p>
<code>Homework1.hs</code>
</p>
<ul class="org-ul">
<li>redeemer is now <code>(Bool, Bool)</code></li>
<li>do <code>undefined</code> / <code>FIX ME!</code></li>
<li>off-chain code is already done</li>
</ul>

<p>
<code>Homework2.hs</code>
</p>
<ul class="org-ul">
<li>redeemer is now a custom <code>data</code> type to represent the two <code>Bool</code></li>
<li>do <code>undefined</code> / <code>FIX ME!</code></li>
<li>off-chain code is already done</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Harold Carr</p>
</div>
</body>
</html>
